<template>
  <v-container class="d-flex fill-height">
    <v-row>
      <v-col>
        <v-row class="pa-2">
          <v-col>
            <div class="text-h4">利用規約</div>
          </v-col>
        </v-row>
        <v-row class="pa-2">
          <v-divider></v-divider>
        </v-row>
        <v-row class="pa-2 mb-4">
          <v-col>
            <v-card variant="text">
              <v-card-text>
                <v-row>
                  <v-col>
                    <div class="pa-4">
                      この利用規約（以下、「本規約」といいます。）は、管理者がこのウェブサイト上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。
                      利用者には、本規約に従って、本サービスをご利用いただきます。
                    </div>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第1条（適用）</div>
                    <div class="pl-4">
                      本規約は、利用者と管理者との間の本サービスの利用に関わる一切の関係に適用されるものとします。
                    </div>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第2条（禁止事項）</div>
                    <div :class="['pl-4', 'pb-4']">
                      利用者は、本サービスの利用にあたり、以下の行為をしてはなりません。
                    </div>
                    <ol class="pl-12">
                      <li>法令または公序良俗に違反する行為</li>
                      <li>犯罪行為に関連する行為</li>
                      <li>本サービスの内容等、本サービスに含まれる著作権、商標権ほか知的財産権を侵害する行為</li>
                      <li>
                        管理者、ほかの利用者、またはその他第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為
                      </li>
                      <li>本サービスによって得られた情報を商業的に利用する行為</li>
                      <li>本サービスの運営を妨害するおそれのある行為</li>
                      <li>不正アクセスをし、またはこれを試みる行為</li>
                      <li>他の利用者に関する個人情報等を収集または蓄積する行為</li>
                      <li>不正な目的を持って本サービスを利用する行為</li>
                      <li>本サービスの他の利用者またはその他の第三者に不利益、損害、不快感を与える行為</li>
                      <li>他の利用者に成りすます行為</li>
                      <li>管理者が許諾しない本サービス上での宣伝、広告、勧誘、または営業行為</li>
                      <li>面識のない異性との出会いを目的とした行為</li>
                      <li>反社会的勢力に対して直接または間接に利益を供与する行為</li>
                      <li>その他、管理者が不適切と判断する行為</li>
                    </ol>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第3条（本サービスの提供の停止等）</div>
                    <ol class="pl-8">
                      <li>
                        管理者は、以下のいずれかの事由があると判断した場合、利用者に事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
                        <ol class="pl-8">
                          <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
                          <li>
                            地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合
                          </li>
                          <li>コンピュータまたは通信回線等が事故により停止した場合</li>
                          <li>その他、管理者が本サービスの提供が困難と判断した場合</li>
                        </ol>
                      </li>
                      <li>
                        管理者は、本サービスの提供の停止または中断により、利用者または第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。
                      </li>
                    </ol>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第4条（利用制限および登録抹消）</div>
                    <ol class="pl-8">
                      <li>
                        管理者は、利用者が以下のいずれかに該当する場合には、事前の通知なく、利用者に対して、本サービスの全部もしくは一部の利用を制限し、または利用者としての登録を抹消することができるものとします。
                        <ol class="pl-8">
                          <li>本規約のいずれかの条項に違反した場合</li>
                          <li>本サービスについて、最終の利用から一定期間利用がない場合</li>
                          <li>その他、管理者が本サービスの利用を適当でないと判断した場合</li>
                        </ol>
                      </li>
                      <li>
                        管理者は、本条に基づき管理者が行った行為により利用者に生じた損害について、一切の責任を負いません。
                      </li>
                    </ol>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第5条（保証の否認および免責事項）</div>
                    <ol class="pl-8">
                      <li>
                        管理者は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
                      </li>
                      <li>
                        管理者は、本サービスに起因して利用者に生じたあらゆる損害について、管理者の故意又は重過失による場合を除き、一切の責任を負いません。
                      </li>
                      <li>
                        管理者は、利用者が本サービスにおいて投稿したすべてのコンテンツに関し、一切の責任を負いません。
                      </li>
                    </ol>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第6条（サービス内容の変更等）</div>
                    <div class="pl-4">
                      管理者は、利用者への事前の告知をもって、本サービスの内容を変更、追加または廃止することがあり、利用者はこれを承諾するものとします。
                    </div>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第7条（利用規約の変更）</div>
                    <ol class="pl-8">
                      <li>
                        管理者は以下の場合には、利用者の個別の同意を要せず、本規約を変更することができるものとします。
                        <ol class="pl-8">
                          <li>本規約の変更が利用者の一般の利益に適合するとき。</li>
                          <li>
                            本規約の変更が本サービス利用契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。
                          </li>
                        </ol>
                      </li>
                      <li>
                        管理者は利用者に対し、前項による本規約の変更にあたり、事前に、本規約を変更する旨及び変更後の本規約の内容並びにその効力発生時期を通知します。
                      </li>
                    </ol>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第8条（個人情報の取扱い）</div>
                    <div class="pl-4">
                      管理者は、本サービスの利用によって取得する個人情報については、別途定める「プライバシーポリシー」に従い適切に取り扱うものとします。
                    </div>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第9条（準拠法・裁判管轄）</div>
                    <ol class="pl-8">
                      <li>本規約の解釈にあたっては、日本法を準拠法とします。</li>
                      <li>本サービスに関して紛争が生じた場合には、京都地方裁判所を専属的合意管轄とします。</li>
                    </ol>
                  </v-col>
                </v-row>
              </v-card-text>
            </v-card>
          </v-col>
        </v-row>
        <v-row class="pa-2">
          <v-col>
            <div class="text-h4">プライバシーポリシー</div>
          </v-col>
        </v-row>
        <v-row class="pa-2">
          <v-divider></v-divider>
        </v-row>
        <v-row class="pa-2">
          <v-col>
            <v-card variant="text">
              <v-card-text>
                <v-row>
                  <v-col>
                    <div class="pa-4">
                      管理者は、本ウェブサイト上で提供するサービス（以下、「本サービス」といいます。）における、利用者の個人情報の取扱いについて、以下のとおりプライバシーポリシー（以下、「本ポリシー」といいます。）を定めます。
                    </div>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第1条（個人情報）</div>
                    <div class="pl-4">
                      「個人情報」とは、本サービス利用時に収集されるTwitterアカウントデータ、Googleアカウントデータ、及びGitHubアカウントデータを指します。
                    </div>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第2条（個人情報を収集・利用する目的）</div>
                    <div :class="['pl-4', 'pb-4']">本サービスが個人情報を収集・利用する目的は、以下のとおりです。</div>
                    <ol class="pl-12">
                      <li>本サービスの提供・運営のため</li>
                      <li>
                        利用規約に違反した利用者や、不正・不当な目的でサービスを利用しようとする利用者の特定をし、ご利用をお断りするため
                      </li>
                      <li>利用者にご自身の個人情報の閲覧や変更、削除、ご利用状況の閲覧を行っていただくため</li>
                      <li>上記の利用目的に付随する目的</li>
                    </ol>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第3条（利用目的の変更）</div>
                    <ol class="pl-8">
                      <li>
                        管理者は、利用目的が変更前と関連性を有すると合理的に認められる場合に限り、個人情報の利用目的を変更するものとします。
                      </li>
                      <li>
                        利用目的の変更を行った場合には、変更後の目的について、本サービス所定の方法により、利用者に通知し、または本ウェブサイト上に公表するものとします。
                      </li>
                    </ol>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第4条（個人情報の提供）</div>
                    <div class="pl-4">
                      本サービスは、公的機関により法令に基づいた要請があった場合に限り、保持している個人情報を第三者に提供します。
                    </div>
                    <div :class="['text-subtitle-1', 'pa-2', 'my-2']">第5条（プライバシーポリシーの変更）</div>
                    <ol class="pl-8">
                      <li>
                        本ポリシーの内容は、法令その他本ポリシーに別段の定めのある事項を除いて、利用者に通知することなく、変更することができるものとします。
                      </li>
                      <li>
                        管理者が別途定める場合を除いて、変更後のプライバシーポリシーは、本ウェブサイトに掲載したときから効力を生じるものとします。
                      </li>
                    </ol>
                  </v-col>
                </v-row>
              </v-card-text>
            </v-card>
          </v-col>
        </v-row>
      </v-col>
    </v-row>
  </v-container>
</template>

<script setup lang="ts">
  import { onMounted } from "vue";

  onMounted(() => {
    document.title = "利用規約 | vinsanet";
  });
</script>

<style scoped>
  .text-subtitle-1 {
    border-left: 5px solid rgb(var(--v-theme-primary));
    background: rgba(var(--v-theme-primary), 0.05);
  }
</style>
